blockedVessel/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 15.238;
    }
    walls
    {
        type            zeroGradient;
    }
    blockFront
    {
        type            zeroGradient;
    }
    blockTop
    {
        type            zeroGradient;
    }
    blockBack
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    top
    {
    	type 		symmetryPlane;
    }
}


// ************************************************************************* //
