blockedVessel/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

x0 0;
x1 1;
x2 1.2;
x3 2.2;
y0 0;
y1 0.5;
y2 2;
y3 0.6;
z0 0;
z1 0.01;

vertices
(
    ($x0 $y0 $z0) ($x1 $y0 $z0) ($x1 $y1 $z0) ($x2 $y1 $z0) ($x2 $y0 $z0) ($x3 $y0 $z0)// 0-5
    ($x0 $y1 $z0) ($x3 $y1 $z0) // 6-7
    ($x0 $y3 $z0) ($x1 $y3 $z0) ($x2 $y3 $z0) ($x3 $y3 $z0)// 8-11
    ($x0 $y0 $z1) ($x1 $y0 $z1) ($x1 $y1 $z1) ($x2 $y1 $z1) ($x2 $y0 $z1) ($x3 $y0 $z1) // 12-17
    ($x0 $y1 $z1) ($x3 $y1 $z1) // 18-19
    ($x0 $y3 $z1) ($x1 $y3 $z1) ($x2 $y3 $z1) ($x3 $y3 $z1)// 20-23
);

blocks
(
    hex (0 1 2 6 12 13 14 18) (100 50 1) simpleGrading (1 1 1)
    hex (6 2 9 8 18 14 21 20) (100 10 1) simpleGrading (1 1 1)
    hex (2 3 10 9 14 15 22 21) (20 10 1) simpleGrading (1 1 1)
    hex (3 7 11 10 15 19 23 22) (100 10 1) simpleGrading (1 1 1)
    hex (4 5 7 3 16 17 19 15) (100 50 1) simpleGrading (1 1 1)
);

edges
(
);

defaultPatch
{
    name frontAndBack;
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 18 12)
	    (6 8 20 18)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 7 19 17)
	    (7 11 23 19)
        );
    }
    walls
    {
        type wall;
        faces
        (
            (0 1 13 12)
	    (4 5 17 16)
        );
    }
    blockFront
    {
    	type wall;
	faces
	(
	    (1 2 14 13)
	);
    }
    blockTop
    {
    	type wall;
	faces
	(
	    (2 3 15 14)
	);
    }
    blockBack
    {
    	type wall;
	faces
	(
	    (3 4 16 15)
	);
    }
    top
    {
	type symmetryPlane;
	faces
	(
	    (8 9 21 20)
	    (9 10 22 21)
	    (10 11 23 22)
	);
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
