blockedVessel/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        system;
    object          sampleDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type surfaces;

enabled true;

writeControl outputTime;

surfaceFormat foam;

interpolationScheme cellPointFace;

// Fields to sample.
fields
(
	p
);

surfaces 
(
	blockFront
	{
		type		patch;
		patches 	(blockFront);
		triangulate	false;
	}
	blockTop
	{
		type		patch;
		patches 	(blockTop);
		triangulate	false;
	}
	blockBack
	{
		type		patch;
		patches 	(blockBack);
		triangulate	false;
	}
);

// *********************************************************************** //
